#! usr/bin/python
# -*- coding:utf-8 -*-
import os
# 日志名称
log_name = "intelligent"
log_error = "errinfo"
ip_types = {
    #     : 'all' 获取全部ip词汇
    # 'all':'全部',
    '3': '影视',
    '2': '赛事',
    '4': '小说',
    '1': '歌手影视类明星',
    '5': '体育类明星',
    '6': '综艺',
}

ip_models = {
    '3': 'yingshi_ip',
    '2': 'f1_ip',
    '4': 'xiaoshuo_ip',
    '5': {'足球': 'zuqiu_ip', '篮球': 'lanqiu_ip', '其他体育': 'other_sports_ip'},
    '6': 'zongyi_ip',
}

ip_related_words = {'3': ['演', '剧', '戏', '电视剧','剧版', '电影', '影片', '女一号', '男一号','女主', '男主', '导演',
                          '拍摄', '角色', '票房', '片段', '新片', '台词', '上映'],
                    '2': ['车队', '队友', '赛车', '方程式', '赛道', '夺冠', '引擎'],
                    '4': ['翻译', '改编', '小说', '章', '卷', '结局', '名著', '作者', '连载', '作品', '读', '剧情', '主人公',
                          '文笔', '名作'],
                    '5': {'篮球': ['篮球', '内线', '外线', '打球', '得分', '篮板', '抢断', '命中率',
                                   '盖帽', '全明星', '2k', '季后赛', '助攻', '阵容', '轮换', '控卫', '控球后卫', '分位',
                                   '小前', '大前', '超巨', '抱团', '西决', '东决', '联盟', '三分',
                                   '新秀', '投篮', 'nba', 'cba', '广东队', '辽宁队',
                                   '上海队', '新疆队', '山西队', '广州队', '深圳队', '四川队', '天津队', '江苏队', '八一队',
                                   '浙江队', '吉林队', '山东队', '老鹰', '凯尔特人', '公牛', '黄蜂', '篮网', '骑士', '热火',
                                   '尼克斯', '活塞', '魔术', '76人', '步行者', '奇才', '猛龙', '雄鹿', '小牛', '掘金', '勇士',
                                   '火箭', '森林狼', '快船', '灰熊', '雷霆', '湖人', '鹈鹕', '开拓者', '太阳', '马刺', '爵士',
                                   '国王', '萧华'],
                          '足球': ['足球', '点球', '俱乐部', '黄牌', '红牌', '单刀', '边路', '边卫', '前锋', '中场', '锋线',
                                   '租借', '补位', '铲球', '后防', '国足', '守门', '首回合', '次回合', '停赛', '头球', '任意球',
                                   '破门', '进球', '后腰', '后卫', '射门', '威胁球', '青训', '翼卫', '德比', '国脚', '推射',
                                   '前腰', '角球', '阵型', '射门', '门将', '飞铲', '足坛', '世界杯','欧洲杯',
                                   '上港', '恒大', '亚泰', '权健', '富力', '申花', '国安', '鲁能',
                                   '中超', '西甲', '英超', '德甲', '意甲', '法甲', '欧冠', '联赛',
                                   '巴萨', '皇马', '皇家马德里', '马竞', '塞维利亚', '利物浦', '曼联', '曼城', '热刺', '阿森纳'
                                   '巴黎圣日耳曼', '摩纳哥', '拜仁', '多特蒙德', '不莱梅', '尤文', '那不勒斯', '国米', 'AC米兰'],
                          '其他体育': ['乒乓', '游泳', '跳水', '花游', '排球', '网球', '选手', '正手', 'vs', '自由泳', '自由泳',
                                       '美网', '澳网', '温网', '网球公开赛', '亚洲记录', '世界纪录', '破纪录', '泳坛', '世锦赛',
                                       '奥运', '中国网球公开赛', '中网', '男双', '女双', '男单', '女单', '混合泳', '蝶泳', '仰泳',
                                       '蛙泳', '游泳池', 'atp', 'wta', '裁判', '金牌', '银牌', '铜牌', '桂冠', '冠军', '百米',
                                       '跳远', '短跑', '跳板', '主攻', '二传', '副攻', '扣球', '网坛', '乒坛'],},
                    '6': ['收官', '片段', '冠名', '季', '开播', '视频', '热播', '播出', '录', '主持', '栏目', '开场', '后台',
                          '参加', '这期', '舞台', '做客', '一期', '看', '花絮', '期待', '忠实粉', '周五', '周六', '周日',
                          '移档', '锁定', '那期', '参加', '本期', '几期']
                    }

star_full_text_related_words = ['娱乐圈', '横店', '拍戏', '节目', '演员', '粉丝', '电影',
                                '电视剧', '影帝', '导演', '歌迷', '影迷', '新歌', '拍mv',
                                '专辑', '演唱', '签名', '歌曲', '综艺', '杀青', '爱奇艺',
                                '演戏', '古装', '热搜', '票房', '影片', '新片', '监制',
                                '嘉宾', '剧照', '巡演', '黑幕', '出道', '机场照', '唱功', '见面会',
                                '演技', '影后', '偶像', '出席活动', '写真', '上映', '剧本', '品牌活动'
                                '好莱坞', '作品', '连续剧', '文艺片', '首映', '镜头',
                                '剧情', '饰演', '真人秀', '感情戏', '客串', '录制', '湖南卫视', '浙江卫视',
                                '韩剧', '海报', '配角', '花絮', '圈粉', '歌手', '模特', '艺人', '音乐会']

star_part_text_related_words = ['身材', '美丽', '好美', '美美', '生日', '后援', '颜值', '角色', '明星',
                                '代言', '封面',  '加油', '喜欢', '支持', '女神', '广告', '单曲',
                                '漂亮', '造型', '女星', '男星']
star_least_text_related_words = ['演', '歌', '唱', '戏', '帅', '粉']


zongyi_full_text_related_words = ['综艺', '节目', '选秀', '卫视', '电视平台', '嘉宾', '导演', '监制', '芒果tv', '真人秀',
                                  '央视', 'cctv', '网综', '剧组', '收视率']