#!/usr/bin/python
# -*- coding: utf-8 -*-

dBrandStrategy = {

    # brand name is easy word , is brand
    'easyword_rule': {'哈佛h6': 1, '哈佛h5': 1, '哈佛h2': 1, '哈佛h3': 1, '哈佛h8': 1, '哈弗h2': 1, '哈弗h3': 1, '哈弗h8': 1, '哈弗h5': 1,
                      '哈弗h6': 1, '小米6': 1, '红米2': 1, '红米note': 1

                      },

    # industry word
    'industry_rule': {
        '母婴': {
            'determiner': [
                '奶粉', '宝宝', '孩子', '婴儿', '益生菌', '段', '妈妈', '好奶', '铂臻', '母婴', '尿不湿', '纸尿裤', '铂金', '金装', '金装新升级', '成长裤',
                '南京工厂', '大宝', '穿', '尿片', '金牌', '宝宝'
            ],
            'fdeterminer': [

            ]
        },
    },

    # hard word
    'hardword_rule': {
        '小米': {
            'determiner': [
                '内屏', '4c', '4a', '4x', '智能', '平衡车', '科技', '安卓', '越狱', '手环', '锤子', '三星', '移动电源', '红米', 'note', '荣耀',
                '手机', '系统', '魅族', '笔记本', '屏幕', '充电宝', '平板', '国产', '净化器', '路由器', '估值', '吸尘器', '平行车', '电视'
            ],
            'fdeterminer': [
                '饭', '粥', '大米'
            ]
        },
        '红米': {
            'determiner': [
                'note', '内屏', '4c', '4a', '4x', '智能', '平衡车', '科技', '安卓', '越狱', '手环', '锤子', '三星', '移动电源', '红米', 'note',
                '荣耀', '手机', '系统', '魅族', '笔记本', '屏幕', '充电宝', '平板', '国产', '净化器', '路由器', '估值', '吸尘器', '平行车', '电视'
            ],
            'fdeterminer': [
                '饭', '粥', '大米'
            ]
        },
        '前途': {
            'determiner': [
                'K50'
            ],
            'fdeterminer': [
                '光明'
            ]
        },
        '理念': {
            'determiner': [
                'S1', '广汽本田'
            ],
            'fdeterminer': [
                '设计', '核心', '环保'

            ]
        },
        '三岁': {
            'determiner': [

            ],
            'fdeterminer': [

            ]
        },
        '哈佛': {
            'determiner': [
                'h5', 'h6', 'h1', 'h2', 'h3', 'h4', 'h7', 'h8', 'h9', '4S店', 'm4'
            ],
            'fdeterminer': [

            ]
        },
        '哈弗': {
            'determiner': [
                'h5', 'h6', 'h1', 'h2', 'h3', 'h4', 'h7', 'h8', 'h9', '4S店', 'm4'
            ],
            'fdeterminer': [

            ]
        },
        '惠氏': {
            'determiner': [
                '奶粉', 'dha', '宝宝', '孩子', '婴儿', '益生菌', '段', '妈妈', '品牌', '包装', '好奶', '买', '铂臻', '母婴'
            ],
            'fdeterminer': [

            ]
        },
        '美素佳儿': {
            'determiner': [
                '奶粉', '皇家', '宝宝', '孩子', '荷兰', '婴儿', '益生菌', '段', '品牌', '好奶', '母婴'
            ],
            'fdeterminer': [

            ]
        },
        '美素': {
            'determiner': [
                '奶粉', '皇家', '宝宝', '孩子', '荷兰', '婴儿', '益生菌', '段', '品牌', '好奶', '母婴'
            ],
            'fdeterminer': [

            ]
        },
        '诺优能': {
            'determiner': [
                '奶粉', '宝宝', '母乳', '官方', '婴儿', '益生菌', '段', '品牌', '好奶', '母婴'
            ],
            'fdeterminer': [

            ]
        },
        '牛栏': {
            'determiner': [
                '奶粉', '宝宝', '母乳', '宝妈', '英国', '荷兰', '婴儿', '益生菌', '段', '品牌', '好奶', '罐', '母婴'
            ],
            'fdeterminer': [

            ]
        },
        '喜宝': {
            'determiner': [
                '奶粉', '宝宝', '母乳', '婴儿', '益生菌', '段', '品牌', '好奶', '母婴'
            ],
            'fdeterminer': [

            ]
        },
        'hipp': {
            'determiner': [
                '奶粉', '宝宝', '母乳', '婴儿', '益生菌', '段', '品牌', '好奶', '母婴'
            ],
            'fdeterminer': [

            ]
        },
        '雅培': {
            'determiner': [
                '奶粉', '宝宝', '母乳', '婴儿', '益生菌', '段', '品牌', '好奶', '母婴'
            ],
            'fdeterminer': [

            ]
        },
        '三星': {
            'determiner': [
                's8', 's7', 'note', 's6', 's5', '苹果', 'iphone', '华为', 'w2017', 'galaxy', '国行', '手机', 'a5', 'g9009d',
                '盖乐视', 'a8', '手机'
            ],
            'fdeterminer': ['酒店', '宾馆', '电视'

                            ]
        },
        '好奇': {
            'determiner': [
                '尿不湿', '纸尿裤', '铂金', '金装', '金装新升级', '成长裤', '南京工厂', '大宝', '孩子', '穿', '尿片', '妈妈', '金牌', '宝宝', '婴儿', '母婴'
            ],
            'fdeterminer': [

            ]
        },
        '帮宝适': {
            'determiner': [
                '尿不湿', '纸尿裤', '铂金装', '金装新升级', '成长裤', '南京工厂', '穿', '尿片', '妈妈', '宝宝', '婴儿', '母婴'
            ],
            'fdeterminer': [

            ]
        },
    }

}
