# -*-coding:utf-8 -*-
my_brands_filter_dict = {
                         u'美赞臣': [u'原装原罐', u'益生元组合', u'pdx+gos', u'优量', u'乳铁蛋白', u'国际权威',
                                     u'优良水平dha', u'奶源安全', u'大于330mg', u'mfgm', u'乳脂球膜'],
                         u'美素佳儿': [u'新鲜直取', u'第一道奶源', u'100%牧场', u'opo', u'天然乳脂', u'液态', u'一次成粉',
                                       u'乳铁蛋白', u'工艺', u'小分子', u'入料', u'一次完成', u'富含', u'锁留系统', u'步步监控'],
                         u'惠氏': [u'神经鞘磷', u'国际知名', u'欧洲原罐', u'接近母乳', u'专利技术opo'],
                         u'惠氏启赋': [u'神经鞘磷', u'国际知名', u'欧洲原罐', u'接近母乳', u'专利技术opo'],
                         }