#!/usr/bin/python
# -*- coding: utf-8 -*-

import os

#
#每个行业对应着一个编号，方便用户按照编号请求某个行业服务。
#
c_servers = {
    '汽车行业品牌识别' : 'brandfind_2',
    '小米品牌识别' : 'brandfind_1',
    '手机行业品牌识别' : 'brandfind_3',
    '母婴行业品牌识别' : 'brandfind_4', 
    '运动行业品牌识别' : 'brandfind_5', 
    '娱乐节目品牌识别' : 'brandfind_6', 
    '美妆行业品牌识别' : 'brandfind_7',
    '健康行业品牌识别' : 'brandfins_14',
    '教育行业品牌识别' : 'brandfind_16',
    '安利品牌识别' : 'brandfind_8',
    '时尚行业品牌识别' : 'brandfind_9',
    '电商行业品牌识别' : 'brandfind_10',
    '网约车行业品牌识别' : 'brandfind_11',
    '通信行业识别' : 'tongxin',
    '美赞臣基础预测服务' : 'mzcbase',
    '美赞臣自然预测服务' : 'mzcziran',
    '共享单车行业品牌识别(仅有策略)' : 'brandfind_12',
    '美食行业品牌识别' : 'brandfind_13'
}

#
#每个行业对应着一个编号，方便用户按照编号请求某个行业服务。
#
c_labels = {
    '汽车行业品牌识别' : { 0 : '噪音', 1 : '非噪音'},
    '小米品牌识别' : { 0 : '噪音', 1 : '非噪音'},
    '手机行业品牌识别' : { 0 : '噪音', 1 : '非噪音'},
    '母婴行业品牌识别' : { 0 : '噪音', 1 : '非噪音'}, 
    '运动行业品牌识别' : { 0 : '噪音', 1 : '非噪音'}, 
    '娱乐节目品牌识别' : { 0 : '噪音', 1 : '非噪音'}, 
    '美妆行业品牌识别' : { 0 : '噪音', 1 : '非噪音'},
    '教育行业品牌识别' : { 0 : '噪音', 1 : '非噪音'},
    '健康行业品牌识别' : { 0 : '噪音', 1 : '非噪音'},
    '安利品牌识别' : { 0 : '噪音', 1 : '非噪音'},
    '时尚行业品牌识别' : { 0 : '噪音', 1 : '非噪音'},
    '电商行业品牌识别(仅有策略)' : { 0 : '噪音', 1 : '非噪音'},
    '网约车行业品牌识别' : { 0 : '噪音', 1 : '非噪音'},
    '共享单车行业品牌识别(仅有策略)' : { 0 : '噪音', 1 : '非噪音'},
    '通信行业识别': { 0 : '噪音', 1 : '非噪音'},
    '美赞臣基础预测服务' : { 0 : 'always-on', 1 : 'campaign', 2: 'sales'},
    '美赞臣自然预测服务' : {0: '购买',1: '问询',2: '使用感受', 3:'新闻',4:'水军',5:'其他'},
    '美食行业品牌识别' : { 0 : '噪音', 1 : '非噪音'}
}

#
#require more information
#
c_more_project = {
    
}
