#coding:utf-8

#否定词
c_neg_word = ['不','不会','无法','不用','不要','再不','从来不', '无法','没有','别','不再','没','无','绝非','非','不是','并非','绝不'
              ,'毫无','切勿','不够','绝非','从没','尚未']

#不需要的形容词
c_adj_filter = ['全','新','老','旗下','原','很多','纯','最大','现代','多','小','优惠','全新','最新','正式','知名','郑重','敏感','柔润','高端','勇敢','基本','具体','老款','不同','有限','平均','连续']

#不可以以这些词结尾
c_endword =['爱','喜欢','效果','参考价','排行榜','红','支持','足','被动','有群','明确','黑','注重','信任','提升']

#不可以以这些词开头
c_startword = ['最高','最好','普通','可以','高','涂','适合','红','早','实际','平均','最快','连续','正好','不足','有没有','特别']

#不可以出现这些词
c_no_meaningword = ['哪款','怎样','哪个','哪样','?','什么','哪里','如果','兴许','为什么']

#在分词时候要去掉的一些词
c_need_password = ['哇塞','这些','还有','会使','使','是']
 
#一些特殊的评价词
#def prepare_filterword():
#    filter_word = []
#    with open('./opinion.index','rb') as f:
#        for line in f :
#            word = line.strip()
#            filter_word.append(word.strip())
#    return filter_word

#精确匹配的短语
c_phrase_match = ['修复细胞间质','能够抗氧化','抑制黑色素','急救脆弱的敏感肌肤','改善干燥','水润无卡粉','减少细纹','焕彩肌肤','修复损伤一级棒','咬牙买单','足够显色','让腮红更服帖','激活肌底','促进吸收','收缩毛孔','去除痘印','提拉紧致' ,'抚平皱纹','去黄提亮','抗倦充能','润泽保湿','平衡水油','淡化斑点','肤色润白','隔离防晒' ,'提亮肤色','深层洁净' ,'淡化黑眼圈','缓解眼袋','平滑眼纹','激发细胞再生潜']

